# Class 7 – Data Handling with Pandas

## Warm-Up: Why Do We Need Pandas?

### What is Data Handling?
Data handling refers to collecting, organizing, processing, and analyzing data to get useful insights.

### Why Pandas?
Pandas is a Python library designed specifically for data manipulation and analysis. It helps us work with structured data like tables or spreadsheets.

### Pandas vs NumPy:
- **NumPy**: Great for numerical operations, mostly with arrays.
- **Pandas**: Built for tabular data like you’d see in Excel (rows and columns).

### Quick Demo:
Let's check if Pandas is installed and see its version.

In [2]:
import pandas as pd 
print("Pandas version:", pd.__version__)

Pandas version: 2.2.1

## Introduction to Pandas

### What is Pandas?
Pandas makes it easy to analyze data stored in tabular form (like spreadsheets).

### Key Components:
- **Series**: A single column (like one list of numbers or names).
- **DataFrame**: A full table with rows and columns.

### Creating a Pandas Series:

In [1]:
import pandas as pd

# Creating a Series (like a single column from Excel)
data = [10, 20, 30, 40]
series = pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
dtype: int64

### Creating a Pandas DataFrame:

Think of a DataFrame as a mini spreadsheet or table.

In [ ]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['NY', 'LA', 'Chicago']
}
df1 = pd.DataFrame(data)
print("Pandas DataFrame:")
print(df1)

Pandas DataFrame:
      Name  Age     City
0    Alice   25       NY
1      Bob   30       LA
2  Charlie   35  Chicago

### Activity:
Create your own Series and DataFrame with student names and marks.

In [ ]:
student_data = {'Name': ['John', 'Emma', 'Ryan'],
                'Marks': [85, 90, 78]}
students_df = pd.DataFrame({'Name': ['John', 'Emma', 'Ryan'],
                'Marks': [85, 90, 78]})
print(students_df)

   Name  Marks
0  John     85
1  Emma     90
2  Ryan     78

## Reading and Writing CSV & Excel Files

### Why Read/Write Files?
Real-world data usually comes from external files like CSV or Excel.

### Reading a CSV File:

In [3]:
# Sample DataFrame for demonstration
sample_df = pd.DataFrame({
    'Name': ['Alice', 'Bob'],
    'Age': [25, 30],
    'City': ['NY', 'LA']
})
sample_df.to_csv('Neha.csv', index=False)
print("Sample CSV created and saved.")

Sample CSV created and saved.

In [ ]:
df_csv= pd.read_csv('tested.csv')

### Reading an Excel File:
(You must have openpyxl installed for this to work.)
### Reading an Excel File
Make sure `data.xlsx` exists in your working directory.

In [5]:
df_excel = pd.read_excel('data.xlsx', sheet_name='Sheet1')
# print(df_excel.head())

FileNotFoundError: [Errno 2] No such file or directory: 'data.xlsx'

### Writing to Files:

In [ ]:
# Writing to CSV
sample_df.to_csv('output.csv', index=False)

# Writing to Excel
sample_df.to_excel('output.xlsx', index=False, sheet_name='Results')

## Data Cleaning and Preprocessing

### Why Clean Data?
Data often has missing values or duplicates that can affect analysis.

### Handling Missing Values:

In [6]:
dirty_df = pd.DataFrame({
    'Name': ['Alice', None, 'Charlie', 'Alice'],
    'Age': [25, None, 35, 25],
    'City': ['NY', 'LA', None, 'NY']
})

print(dirty_df)

      Name   Age  City
0    Alice  25.0    NY
1     None   NaN    LA
2  Charlie  35.0  None
3    Alice  25.0    NY

In [8]:
clean_df = dirty_df.dropna()
print(clean_df)

    Name   Age City
0  Alice  25.0   NY
3  Alice  25.0   NY

In [8]:
dirty_df = pd.DataFrame({
    'Name': ['Alice', None, 'Charlie', 'Alice'],
    'Age': [25, None, 35, 25],
    'City': ['NY', 'LA', None, 'NY']
})

# Remove rows with missing values
clean_df = dirty_df.dropna()

# Fill missing values with 0
filled_df = dirty_df.fillna(0)

print("Dropped NA:")
print(clean_df)
print("Filled NA:")
print(filled_df)

Dropped NA:
    Name   Age City
0  Alice  25.0   NY
3  Alice  25.0   NY
Filled NA:
      Name   Age City
0    Alice  25.0   NY
1        0   0.0   LA
2  Charlie  35.0    0
3    Alice  25.0   NY

### Removing Duplicate Data:

In [9]:
no_duplicates = dirty_df.drop_duplicates()
print("Without duplicates:")
print(no_duplicates)

Without duplicates:
      Name   Age  City
0    Alice  25.0    NY
1     None   NaN    LA
2  Charlie  35.0  None

### Renaming Columns and Changing Data Types:

In [ ]:
df.rename(columns={'OldName': 'NewName'}, inplace=True)

In [9]:
dirty_df.rename(columns={'Name': 'StudentName'}, inplace=True)
print(dirty_df)

  StudentName   Age  City
0       Alice  25.0    NY
1        None   NaN    LA
2     Charlie  35.0  None
3       Alice  25.0    NY

In [ ]:
dirty_df['Age'] = dirty_df['Age'].fillna(0).astype(int)
print("Renamed and changed type:")

## Data Analysis with Pandas

### Filtering, Sorting, Aggregation

In [ ]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 17, 35, 40],
    'City': ['NY', 'LA', 'Chicago', 'NY']
})

# Filtering
adults = df[df['Age'] > 18]
print("Adults:")
print(adults)

# Sorting
df.sort_values(by='Age', ascending=False, inplace=True)
print("Sorted by Age:")
print(df)

# Aggregation
print("Average Age:", df['Age'].mean())
print("People per City:")
print(df['City'].value_counts())

Adults:
      Name  Age     City
0    Alice   25       NY
2  Charlie   35  Chicago
3    David   40       NY
Sorted by Age:
      Name  Age     City
3    David   40       NY
2  Charlie   35  Chicago
0    Alice   25       NY
1      Bob   17       LA
Average Age: 29.25
People per City:
City
NY         2
Chicago    1
LA         1
Name: count, dtype: int64

In [12]:
df.shape

(4, 3)

## Titanic Dataset

In [14]:
df= pd.read_csv('tested.csv')

In [ ]:
df.shape

(418, 12)

In [ ]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [ ]:
df.tail(9)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [20]:
df.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
369,1261,0,2,"Pallas y Castello, Mr. Emilio",male,29.00,0,0,SC/PARIS 2147,13.8583,NaN,C
182,1074,1,1,"Marvin, Mrs. Daniel Warner (Mary Graham Carmic...",female,18.00,1,0,113773,53.1000,D30,S
119,1011,1,2,"Chapman, Mrs. John Henry (Sara Elizabeth Lawry)",female,29.00,1,0,SC/AH 29037,26.0000,NaN,S
346,1238,0,2,"Botsford, Mr. William Hull",male,26.00,0,0,237670,13.0000,NaN,S
250,1142,1,2,"West, Miss. Barbara J",female,0.92,1,2,C.A. 34651,27.7500,NaN,S
126,1018,0,3,"Brobeck, Mr. Karl Rudolf",male,22.00,0,0,350045,7.7958,NaN,S
387,1279,0,2,"Ashby, Mr. John",male,57.00,0,0,244346,13.0000,NaN,S
280,1172,1,3,"Oreskovic, Miss. Jelka",female,23.00,0,0,315085,8.6625,NaN,S
393,1285,0,2,"Gilbert, Mr. William",male,47.00,0,0,C.A. 30769,10.5000,NaN,S
66,958,1,3,"Burns, Miss. Mary Delia",female,18.00,0,0,330963,7.8792,NaN,Q

In [22]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [10]:
df_csv.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [26]:
df.shape

(418, 12)

In [27]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

In [25]:
df1 = df.dropna()
df1.shape

(87, 12)

## Wrap-Up and Homework

### Recap:
- Created Series and DataFrames with Pandas
- Learned to read/write CSV and Excel files
- Cleaned data (missing values, duplicates)
- Performed basic data analysis

### Homework:
1. Load a CSV file and display the first 10 rows.
2. Remove duplicate rows and handle missing values in a dataset.
3. Sort a dataset by age and find the total number of people from each city.